app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("name", "email", "description", "created_at", "updated_at") VALUES ('a', '', '', '2025-06-11 06:20:48.156714', '2025-06-11 06:20:48.156714') RETURNING "id"

  def update
    respond_to do |format|
      if @author.update(author_params)
---
UPDATE "authors" SET "name" = '', "updated_at" = '2025-06-11 06:20:55.816980' WHERE "authors"."id" = 11

  def destroy
    @author.destroy!
---
DELETE FROM "authors" WHERE "authors"."id" = 11

    def set_author
      @author = Author.find(params.expect(:id))
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = NULL LIMIT 1