app/controllers/blog_posts_controller.rb

SELECT "blog_posts".* FROM "blog_posts"
---
  def index
    @blog_posts = BlogPost.all

INSERT INTO "blog_posts" ("title", "summary", "body", "tags", "author_id", "created_at", "updated_at") VALUES ('Artificial intelligence', 'AI·', 'ai is the inteliigence', 'ai', 5, '2025-06-10 11:16:49.527330', '2025-06-10 11:16:49.527330') RETURNING "id"
---
  def create
    @blog_post = BlogPost.new(post_params)
    if @blog_post.save

UPDATE "blog_posts" SET "author_id" = 7, "updated_at" = '2025-06-10 11:31:25.973787' WHERE "blog_posts"."id" = 3
---
  def update
    if @blog_post.update(post_params)

DELETE FROM "blog_posts" WHERE "blog_posts"."id" = 2
---
  def destroy
    @blog_post.destroy

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = 2 LIMIT 1
---
  def set_post
    @blog_post = BlogPost.find(params[:id])